//
//  Theme.swift
//  SwiftDemo
//
//  Created by HouWan on 2020/5/8.
//  Copyright © 2020 HouWan. All rights reserved.
//

import Foundation


//    约定一：颜色全部用十六进制表示，但是注释上RGB的数值和REX数值
//    约定二：所有颜值，全部在此定义和获取，代码中不允许使用UIColor获取颜色
//    约定三：颜色常量名建议不要指明具体色彩，因为比如白色背景，如果命名为`white_bg`,在深色模式，它可能代表黑色
//    约定三：为了将来主题(or.深色模式)开发，严格遵守一、二、三




///=============================================================================
/// - Note: 背景色
///=============================================================================

/// White Color (RGB:255,255,255)
let theme_tint_A_color = UIColor.white





///=============================================================================
/// - Note: 文本颜色
///=============================================================================

/// Color (RGB:45,45,45) | (0x2D2D2D)
let theme_text_A_color = UIColor(0x2D2D2D)
/// Color (RGB:176,176,176) | (0xB0B0B0)
let theme_text_B_color = UIColor(0xB0B0B0)



















